package by.academy.lesson17;

//7.
//Создайте HashMap, содержащий пары значений  - 
//имя игрушки и объект игрушки (класс Toy).
//Перебрать и распечатать пары значений - entrySet().
//Перебрать и распечатать набор из имен продуктов  - keySet().
//Перебрать и распечатать значения продуктов - values().
//Для каждого перебора создать свой метод.
//8.
//Создать класс Student, содержащий следующие характеристики
// – имя, группа, курс, оценки по предметам. 
// Создать коллекцию, содержащую объекты класса Student. 
// Написать метод, который удаляет студентов со средним баллом <3.
// Если средний балл>=3, студент переводится на следующий курс.
// Напишите метод printStudents(List<Student> students, int course),
// который получает список студентов и номер курса и печатает на консоль имена тех студентов из списка, которые обучаются на данном курсе.
