package by.academy.lesson.Array.Task;

import java.util.Arrays;

public class ArrayClassWork1 {
//	1. Создать массив типа double с размером 4.
//	 Записать в него любые значения с помощью блока для инициализации. 
//	 Вывести на консоль значение первого элемента. 
	public static void main(String[] args) {

		double[] array = new double[4];
		
		array[0] = 3;
		
		System.out.println(Arrays.toString(array));

	}

}
